TexasInstruments/mcupsdk-core-k3/test/drivers/mmcsd/test_mmcsd_fs_io/am62dx-evm/c75ss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Dx" --part "AM62D22-G" --package "ANF" --context "c75ss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM62D-Q1" --package "FCBGA (ANF)" --variant "AM62D22-G" --context "c75ss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.24.0+4150"}
 */

/**
 * Import the modules used in this configuration.
 */
const freertos_fat  = scripting.addModule("/fs/freertos_fat/freertos_fat", {}, false);
const freertos_fat1 = freertos_fat.addInstance();
const freertos_fat2 = freertos_fat.addInstance();
const debug_log     = scripting.addModule("/kernel/dpl/debug_log");
const mmu_armv8     = scripting.addModule("/kernel/dpl/mmu_armv8", {}, false);
const mmu_armv81    = mmu_armv8.addInstance();
const mmu_armv82    = mmu_armv8.addInstance();
const mmu_armv83    = mmu_armv8.addInstance();
const mmu_armv84    = mmu_armv8.addInstance();
const mmu_armv85    = mmu_armv8.addInstance();
const mmu_armv86    = mmu_armv8.addInstance();
const mmu_armv87    = mmu_armv8.addInstance();
const mmu_armv88    = mmu_armv8.addInstance();
const mmu_armv89    = mmu_armv8.addInstance();
const mmu_armv810   = mmu_armv8.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
freertos_fat1.$name                  = "CONFIG_FREERTOS_FAT0";
freertos_fat1.peripheralDriver.$name = "CONFIG_MMCSD_SD";

freertos_fat2.$name                  = "CONFIG_FREERTOS_FAT1";
freertos_fat2.media                  = "EMMC";
freertos_fat2.peripheralDriver.$name = "CONFIG_MMCSD_EMMC";

debug_log.enableUartLog                   = true;
debug_log.uartLog.$name                   = "CONFIG_UART0";
debug_log.uartLog.useMcuDomainPeripherals = true;

mmu_armv81.size  = 0x20000000;
mmu_armv81.$name = "REGISTER_REGION_0";

mmu_armv82.vAddr = 0x20000000;
mmu_armv82.pAddr = 0x20000000;
mmu_armv82.size  = 0x20000000;
mmu_armv82.$name = "REGISTER_REGION_1";

mmu_armv83.vAddr = 0x40000000;
mmu_armv83.pAddr = 0x40000000;
mmu_armv83.size  = 0x20000000;
mmu_armv83.$name = "REGISTER_REGION_2";

mmu_armv84.vAddr = 0x60000000;
mmu_armv84.pAddr = 0x60000000;
mmu_armv84.size  = 0x10000000;
mmu_armv84.$name = "FSS0_DAT_REGION";

mmu_armv85.vAddr = 0x7C200000;
mmu_armv85.pAddr = 0x7C200000;
mmu_armv85.$name = "CLEC";
mmu_armv85.size  = 0x100000;

mmu_armv86.$name = "DRU";
mmu_armv86.vAddr = 0x7C400000;
mmu_armv86.pAddr = 0x7C400000;
mmu_armv86.size  = 0x100000;

mmu_armv87.vAddr     = 0x80000000;
mmu_armv87.pAddr     = 0x80000000;
mmu_armv87.size      = 0x20000000;
mmu_armv87.attribute = "MAIR7";
mmu_armv87.$name     = "DDR_0";

mmu_armv88.vAddr     = 0xA0000000;
mmu_armv88.pAddr     = 0xA0000000;
mmu_armv88.size      = 0x20000000;
mmu_armv88.attribute = "MAIR7";
mmu_armv88.$name     = "DDR_1";

mmu_armv89.vAddr     = 0xAA000000;
mmu_armv89.pAddr     = 0xAA000000;
mmu_armv89.size      = 0x2000000;
mmu_armv89.attribute = "MAIR4";
mmu_armv89.$name     = "DDR_2";

mmu_armv810.$name     = "CCS_DEBUG_LOG_MEM";
mmu_armv810.vAddr     = 0x99C10000;
mmu_armv810.pAddr     = 0x99C10000;
mmu_armv810.size      = 0x1000;
mmu_armv810.attribute = "MAIR4";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
freertos_fat1.peripheralDriver.MMC1.$suggestSolution      = "MMC1";
freertos_fat1.peripheralDriver.MMC1.CLK.$suggestSolution  = "MMC1_CLK";
freertos_fat1.peripheralDriver.MMC1.CMD.$suggestSolution  = "MMC1_CMD";
freertos_fat1.peripheralDriver.MMC1.DAT0.$suggestSolution = "MMC1_DAT0";
freertos_fat1.peripheralDriver.MMC1.DAT1.$suggestSolution = "MMC1_DAT1";
freertos_fat1.peripheralDriver.MMC1.DAT2.$suggestSolution = "MMC1_DAT2";
freertos_fat1.peripheralDriver.MMC1.DAT3.$suggestSolution = "MMC1_DAT3";
freertos_fat1.peripheralDriver.MMC1.SDCD.$suggestSolution = "MMC1_SDCD";
freertos_fat2.peripheralDriver.MMC0.$suggestSolution      = "MMC0";
freertos_fat2.peripheralDriver.MMC0.CLK.$suggestSolution  = "MMC0_CLK";
freertos_fat2.peripheralDriver.MMC0.CMD.$suggestSolution  = "MMC0_CMD";
freertos_fat2.peripheralDriver.MMC0.DAT0.$suggestSolution = "MMC0_DAT0";
freertos_fat2.peripheralDriver.MMC0.DAT1.$suggestSolution = "MMC0_DAT1";
freertos_fat2.peripheralDriver.MMC0.DAT2.$suggestSolution = "MMC0_DAT2";
freertos_fat2.peripheralDriver.MMC0.DAT3.$suggestSolution = "MMC0_DAT3";
freertos_fat2.peripheralDriver.MMC0.DAT4.$suggestSolution = "MMC0_DAT4";
freertos_fat2.peripheralDriver.MMC0.DAT5.$suggestSolution = "MMC0_DAT5";
freertos_fat2.peripheralDriver.MMC0.DAT6.$suggestSolution = "MMC0_DAT6";
freertos_fat2.peripheralDriver.MMC0.DAT7.$suggestSolution = "MMC0_DAT7";
debug_log.uartLog.MCU_UART.$suggestSolution               = "MCU_USART0";
debug_log.uartLog.MCU_UART.RXD.$suggestSolution           = "MCU_UART0_RXD";
debug_log.uartLog.MCU_UART.TXD.$suggestSolution           = "MCU_UART0_TXD";
